# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'nektos/tap'
tap 'scalacenter/bloop'
tap 'homebrew/cask-fonts'
tap "github/gh"

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'git-lfs'
brew "github/gh/gh"
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'peco'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'wget'
brew 'yq'

# Development
brew 'bazel'
brew 'cloc'
brew 'cmake'
brew 'ghq'
brew 'git'
brew 'go'
brew 'fzf'
brew 'ipmitool'
brew 'jq'
brew 'kotlin'
brew 'minikube'
brew 'node'
brew 'pwgen'
brew 'rbenv'
brew 'sbt'
brew 'scalastyle'
brew 'terraform'
brew 'zsh'
brew 'zsh-completions'
brew 'scalacenter/bloop/bloop'

# Apps
cask 'alfred'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask "google-cloud-sdk"
cask 'gpg-suite'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'visual-studio-code'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-jetbrains-mono'

# Mac App Store
mas 'Evernote', id: 406056744
mas 'Giphy Capture', id: 668208984
mas 'Magnet', id: 441258766
mas 'Todoist', id: 585829637
mas 'Xcode', id: 497799835
